app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params["file"].path, headers: true) do |song|
      s = Song.find_or_create_by(title: song[0])
      s.artist = Artist.find_or_create_by(name: song[1])
---
INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2019-03-03 08:23:04.113604"], ["updated_at", "2019-03-03 08:23:04.113604"], ["artist_id", 138]]
SELECT  "songs".* FROM "songs" WHERE "songs"."title" = ? LIMIT ?  [["title", "Caught Up in You"], ["LIMIT", 1]]
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2019-03-03 08:20:40.625922"], ["updated_at", "2019-03-03 08:20:40.625922"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT ?  [["name", ".38 Special"], ["LIMIT", 1]]